package com.gb.dudarev.lesson1;

public class Main {

    ///1. Создать пустой проект в IntelliJ IDEA и прописать метод main().
    public static void main(String[] args) {

        //2. Создать переменные всех пройденных типов данных и инициализировать их значения.
        byte b = (byte) 01111111;
        short s = 32767;
        int i = 2147483647;
        long l = 1L;
        float f = 2.5F;
        double d = 2.3;
        char c = 'c';
        boolean bTrue = true;
        boolean bFalse = false;

        //3. Написать метод, вычисляющий выражение a * (b + (c / d)) и возвращающий результат,
                //где a, b, c, d – аргументы этого метода, имеющие тип float.
        //System.out.println(a * (b + (c / d));
        //4. Написать метод, принимающий на вход два целых числа и проверяющий, что их сумма лежит в пределах от 10 до 20 (включительно), если да – вернуть true, в противном случае – false.
        //5. Написать метод, которому в качестве параметра передается целое число, метод должен напечатать в консоль, положительное ли число передали или отрицательное. Замечание: ноль считаем положительным числом.
        //6. Написать метод, которому в качестве параметра передается целое число. Метод должен вернуть true, если число отрицательное, и вернуть false если положительное.
        //7. Написать метод, которому в качестве параметра передается строка, обозначающая имя. Метод должен вывести в консоль сообщение «Привет, указанное_имя!».
        //8. * Написать метод, который определяет, является ли год високосным, и выводит сообщение в консоль. Каждый 4-й год является високосным, кроме каждого 100-го, при этом каждый 400-й – високосный.

    }
}
